#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  ;; (async-shell-command "flatpak-spawn --host ./install.sh" "log" "err")
#+end_src

#+RESULTS:
| /home/asd/config_storage/debootstrap/debian_stable_backports.list | /home/asd/config_storage/debootstrap/debian_stable.list | /home/asd/config_storage/debootstrap/debian_testing.list | /home/asd/config_storage/debootstrap/xanmod.list | /home/asd/config_storage/debootstrap/functions.sh | /home/asd/config_storage/debootstrap/install.sh |

*** Write fstab
#+begin_src sh :shebang #!/bin/bash :results output :tangle ./install.sh
  write_fstab
#+end_src

#+RESULTS:
: /home/asd/GITLAB/aravindhv101/config_storage	/	btrfs	compress=zstd:3,autodefrag,rw	0	1

